[
    {
        "id": 1,
        "title": "Summer fun!",
		"datetime": "August 1, 2025",
		"content": "Hey there! I got lot going today. I started reading Summer Fun by Lammy award winner Jeanne Thornton, and my good friend Tenacity Plys (see above) just announced being selected as the finalist for a Lammy Award too! That's so awesome. Good for xem! That reminds me that after Summer Fun, . If you're in the NYC/NJ area, check out the where you can find all these cool people in their local habitat!"
	
    },
	{
		"id": 2,
        "title": "Birthdays and Anxieties",
		"datetime": "August 3, 2025",
		"content": "Happy birthday to my lil niece! She's 6 today! I guess I really am an unc now! I'm cool with it. What I'm not cool with tho is some sicknesses happening in the family. The most I can do is distract myself tho. Keep me in your thoughts, y'all!"
	},
	{
		"id": 3,
		"title": "Heavy Day...",
		"datetime": "Aug 6, 2025",
		"content": "My aunt passed away today. It's tough. I'll continue updates when I can. Peace, y'all."
	},
	{
		"id": 4,
		"title": "Burgers and Shows in NJ",
		"datetime": "Aug 20, 2025",
		"content": "I went to see AJJ last night! My first AJJ show ever and it was a blast! Special thanks to Katherine for hanging with me! I def needed it!"
	},
	{
		"id": 5,
		"title":"Catching Up on Anime",
		"datetime":"Aug 22, 2025",
		"content":"Yofukashi no Uta is peak. That is all. This week's ep of Osomatsu-san wasn't bad either."
	},
	{"id": 6,
	"title": "Catching Up on Anime cont.d",
	"datetime": "Aug 23, 2025",
	"content": "I binged Call of the Peak's Paradse Arc. Great stuff! I missed Ko and Anko's aura farming. I'm fine if Nazuna doesn't show and we just a side series with those two tbh. Okay, back to writing stuff, lol. Oh yeah, I'm also currently reading Jeanne Thornton's Summer Fun and I'm loving it so far."
}
]
				
					<h4>Let's go, GO-MAN!!</h4>
					<h5>Aug 26, 2025</h5>
					<p>I binged Hamish Steele's new graphic novel Go-Man in less than two hours. Oh man, so good! Also, amazing autistic and queer representation as always! I can't believe I hate to wait for the next volume! It was getting so good 😭. Oh well, until next time!
						
					P.S: I worked on some music today as well! I'm looking forward to that!</p>
				</article>
				<article>
					<h4>Ordinary Day</h4>
					<h5>Aug 27, 2025</h5>
					<p>I focused mostly on writing music today and body doubling with a friend! I've also been having trouble with MS Rewards more lately. Just a lot of bugginess and false flagging of my points account. Honestly, after almost a decade, I might stop using it. Sucks. Oh well. Until next time i guess!</p>
				</article>
				<article>
					<h4>Precursor to the weekend</h4>
					<h5>Aug 28, 2025</h5>
					<p>I wasn't feeling great today. The bad news is I had to cancel plans I made with a friend. The good news is that I got my copy of Summer Fun! I've also started working more on my music! I'm so excited for where that will go! Talk to you soon!</p>
				</article>
				<article>
					<h4>Much Music, More News!</h4>
					<h5>Aug 29, 2025</h5>
					<p>Came up with more music today! I'm super excited now! Oh yeah, I'm really enjoying my new thermal sticker printer too, and it's fun coming up with new designs! I also started reading One Piece! Oh yeah, wish me luck!</p>
				</article>
				<article>
					<h4>Of Bodies and Health</h4>
					<h5>Aug 30, 2025</h5>
					<p>I went to Hamish Steele's virtual sign up session for Go-Man and it was great! Motivation get! In less steller news, I've been dealing with a particular health issue for a while now that's got me down. It seems like I might need surgery for it sooner than I thought. A friend told me they're sorry I have to have a body when I had to cancel on them bc of the same issue, in reference to AJJ's Body Terror Song. I really appreciated it. I really appreciate my friends.</p>
				</article>
				<article>
					<h4>It's Good to Have Friends</h4>
					<h5>Sep 5, 2025</h5>
					<p>I went to a funeral today. It was rough, but at least my friends helped me through it. That's all. I'll prob add more later.</p>
				</article>
				<article>
					<h4>Sep 6, 2025</h4>
					<h5>Day After</h5>
					<p>I mostly slept today. I really didn't have it in me to do anything else. My little niece came over and helped brighten the mood. Otherwise, it was a pretty lowkey day.</p>
				</article>
				<article>
					<h4>Slow Day</h4>
					<h5>Sep 7, 2025</h5>
					<p>I came up with more music today and I cleaned out my drawers. Yay! Productivity! It def helps when body doubling with a friend too. It was a pretty good day all things considered! Tomorrow I have to go out and do a ton of stuff in the outside world I've been putting off. Ah...the joys of being neurodivergent. I think I'll devote a day to really working on this site too. Till then, see ya!</p>
				</article>
				<article>
					<h4>Summer's Waning</h4>
					<h5>Sep 8, 2025</h5>
					<p>Funerals have gone and passed, and I feel particularly listless about things. It's been a year now since a pretty traumatic incident, and I still don't know how to process it. Maybe I never will. I've gone back to working on Traversal for now, as well as a few newer projects for later on down the road. Fingers crossed! All I can do now is take things one day at a time, like always.</p>
				</article>
				<article>
					<h4>Tough Decisions</h4>
					<h5>Sep 9, 2025</h5>
					<p>I vented to my friend today about everything going on. It helped me feel better, but then it didn't. After that, we watched a movie and it actually helped me feel much better. It made me but I don't like them that way (no offense) and they have a partner anyway. I guess I've just been thinking alot of delving into that aspect of my life now, even if I have no idea how.</p>
				</article>